; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-4degree-100mindistance-6trucks-2packages-915seed

(define (problem transport-two-cities-sequential-5nodes-1000size-4degree-100mindistance-6trucks-2packages-915seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  truck-5 - vehicle
  truck-6 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 849,51 -> 815,324
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 28)
  ; 815,324 -> 849,51
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 28)
  ; 436,481 -> 177,319
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 31)
  ; 177,319 -> 436,481
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 31)
  ; 436,481 -> 815,324
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 41)
  ; 815,324 -> 436,481
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 41)
  ; 436,481 -> 494,852
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 38)
  ; 494,852 -> 436,481
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 38)
  ; 436,481 -> 849,51
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 60)
  ; 849,51 -> 436,481
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 60)
  ; 2319,285 -> 2518,62
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 30)
  ; 2518,62 -> 2319,285
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 30)
  ; 2985,407 -> 2518,62
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 59)
  ; 2518,62 -> 2985,407
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 59)
  ; 2190,703 -> 2319,285
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 44)
  ; 2319,285 -> 2190,703
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 44)
  ; 2765,372 -> 2518,62
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 40)
  ; 2518,62 -> 2765,372
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 40)
  ; 2765,372 -> 2319,285
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 46)
  ; 2319,285 -> 2765,372
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 46)
  ; 2765,372 -> 2985,407
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 23)
  ; 2985,407 -> 2765,372
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 23)
  ; 815,324 <-> 2190,703
  (road city-1-loc-2 city-2-loc-4)
  (= (road-length city-1-loc-2 city-2-loc-4) 143)
  (road city-2-loc-4 city-1-loc-2)
  (= (road-length city-2-loc-4 city-1-loc-2) 143)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-3)
  (at truck-1 city-2-loc-1)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-1)
  (capacity truck-2 capacity-4)
  (at truck-3 city-2-loc-2)
  (capacity truck-3 capacity-4)
  (at truck-4 city-2-loc-5)
  (capacity truck-4 capacity-2)
  (at truck-5 city-2-loc-4)
  (capacity truck-5 capacity-2)
  (at truck-6 city-2-loc-4)
  (capacity truck-6 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-1)
  (at package-2 city-2-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-5 city-2-loc-4 city-1-loc-2)
   deleted: (at truck-5 city-2-loc-4)
   added: (at truck-5 city-1-loc-2)
   goals met: 0 of 2
2. (drive truck-5 city-1-loc-2 city-1-loc-5)
   deleted: (at truck-5 city-1-loc-2)
   added: (at truck-5 city-1-loc-5)
   goals met: 0 of 2
3. (drive truck-5 city-1-loc-5 city-1-loc-3)
   deleted: (at truck-5 city-1-loc-5)
   added: (at truck-5 city-1-loc-3)
   goals met: 0 of 2
4. (pick-up truck-5 city-1-loc-3 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-3) (capacity truck-5 capacity-2)
   added: (in package-2 truck-5) (capacity truck-5 capacity-1)
   goals met: 0 of 2
5. (drive truck-5 city-1-loc-3 city-1-loc-5)
   deleted: (at truck-5 city-1-loc-3)
   added: (at truck-5 city-1-loc-5)
   goals met: 0 of 2
6. (drive truck-5 city-1-loc-5 city-1-loc-1)
   deleted: (at truck-5 city-1-loc-5)
   added: (at truck-5 city-1-loc-1)
   goals met: 0 of 2
7. (pick-up truck-5 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-5 capacity-1)
   added: (in package-1 truck-5) (capacity truck-5 capacity-0)
   goals met: 0 of 2
8. (drive truck-5 city-1-loc-1 city-1-loc-5)
   deleted: (at truck-5 city-1-loc-1)
   added: (at truck-5 city-1-loc-5)
   goals met: 0 of 2
9. (drive truck-5 city-1-loc-5 city-1-loc-2)
   deleted: (at truck-5 city-1-loc-5)
   added: (at truck-5 city-1-loc-2)
   goals met: 0 of 2
10. (drive truck-5 city-1-loc-2 city-2-loc-4)
   deleted: (at truck-5 city-1-loc-2)
   added: (at truck-5 city-2-loc-4)
   goals met: 0 of 2
11. (drive truck-5 city-2-loc-4 city-2-loc-2)
   deleted: (at truck-5 city-2-loc-4)
   added: (at truck-5 city-2-loc-2)
   goals met: 0 of 2
12. (drive truck-5 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-5 city-2-loc-2)
   added: (at truck-5 city-2-loc-1)
   goals met: 0 of 2
13. (drop truck-5 city-2-loc-1 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-5) (capacity truck-5 capacity-0)
   added: (at package-1 city-2-loc-1) (capacity truck-5 capacity-1)
   goals met: 1 of 2
14. (drive truck-5 city-2-loc-1 city-2-loc-5)
   deleted: (at truck-5 city-2-loc-1)
   added: (at truck-5 city-2-loc-5)
   goals met: 1 of 2
15. (drop truck-5 city-2-loc-5 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-5) (capacity truck-5 capacity-1)
   added: (at package-2 city-2-loc-5) (capacity truck-5 capacity-2)
   goals met: 2 of 2
